## Production: cloudfront
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 4 to add, 0 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                              NAME                              |
|----------|----------------------------------------------------------------|
| recreate | `aws_kinesis_firehose_delivery_stream.cds_website_waf`         |
| add      | `aws_route53_record.cds_website_A[&quot;digital.cdssandbox.xyz&quot;]`   |
|          | `aws_route53_record.cds_website_A[&quot;numerique.cdssandbox.xyz&quot;]` |
|          | `aws_wafv2_web_acl_logging_configuration.cds_website_waf`      |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_kinesis_firehose_delivery_stream.cds_website_waf must be replaced
-/+ resource "aws_kinesis_firehose_delivery_stream" "cds_website_waf" {
      ~ arn            = "arn:aws:firehose:us-east-1:521732289257:deliverystream/aws-waf-log-cds-website" -> (known after apply)
      ~ destination_id = "destinationId-000000000001" -> (known after apply)
      ~ id             = "arn:aws:firehose:us-east-1:521732289257:deliverystream/aws-waf-log-cds-website" -> (known after apply)
      ~ name           = "aws-waf-log-cds-website" -> "aws-waf-logs-cds-website" # forces replacement
        tags           = {
            "CostCentre" = "digital-canada-website-production"
            "Terraform"  = "true"
        }
      ~ version_id     = "2" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ extended_s3_configuration {
            # (7 unchanged attributes hidden)

          - processing_configuration {
              - enabled = false -> null
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # aws_route53_record.cds_website_A["digital.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "cds_website_A" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "digital.cdssandbox.xyz"
      + type            = "A"
      + zone_id         = "Z2FDTNDATAQYW2"

      + alias {
          + evaluate_target_health = false
          + name                   = "d1521nfitmrfqw.cloudfront.net"
          + zone_id                = "Z2FDTNDATAQYW2"
        }
    }

  # aws_route53_record.cds_website_A["numerique.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "cds_website_A" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "numerique.cdssandbox.xyz"
      + type            = "A"
      + zone_id         = "Z2FDTNDATAQYW2"

      + alias {
          + evaluate_target_health = false
          + name                   = "d1drqcaw0n1gh3.cloudfront.net"
          + zone_id                = "Z2FDTNDATAQYW2"
        }
    }

  # aws_wafv2_web_acl_logging_configuration.cds_website_waf will be created
  + resource "aws_wafv2_web_acl_logging_configuration" "cds_website_waf" {
      + id                      = (known after apply)
      + log_destination_configs = (known after apply)
      + resource_arn            = "arn:aws:wafv2:us-east-1:521732289257:global/webacl/cds_website_waf/8cded49b-34e3-45ab-a44d-6cc1f4ec91d5"
    }

Plan: 4 to add, 0 to change, 1 to destroy.

Warning: Argument is deprecated

  with module.log_bucket.aws_s3_bucket.this,
  on .terraform/modules/log_bucket/S3_log_bucket/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
